using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

using WebEminari.Data.Models;

namespace WebEminari.Data.Seeding
{
    public class WebEminarsSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            var dateTime1 = new DateTime(2022, 5, 3, 3, 20, 0);
            var dateTime2 = new DateTime(2022, 5, 6, 6, 30, 0);
            var dateTime3 = new DateTime(2022, 5, 8, 7, 10, 0);

            if (dbContext.WebEminars.Any())
            {
                return;
            }

            await dbContext.WebEminars.AddAsync(new WebEminar()
            {
                Title = "Youth participation in city Transformation",
                Description = "Младежките делегати на Република България в сътрудничество с Младежкия наблюдател на САЩ, Младежките Делегати на Унгария и Литва организират виртуално събитие, което ще се проведе на 14 февруари от 11:30 до 12:45 часа EST, за да чуете Младежки Дел egates и възгледите на поканените лектори за темата за Младежкото участие в градската трансформация.Следете събитието тук или се регистрирайте за интерактивно участие през zoom!Страничното събитие на 60-ата сесия на ЦОЦД, озаглавено „Младежко участие в градската трансформация“, ще се проведе виртуално с участието на младежките делегати на редица държави към ООН, сред които Република България, Унгария, Република Литва, Съединените американски щати и други поканени лектори. Събитието ще събере представители на младежите и ще предостави платформа за обмен на мнения и идеи относно проекти и инициативи във връзка с темата „Как младежкото участие може да бъде полезно и трансформационно за нашите градове и публични пространства, за да ги направим по-приобщаващи, по-здрави, по-щастливи и издръжливи места за споделяне и живеене.Програма на събитието(източно стандартно време)11:30 - 11:35 Посрещане и запознаване.Фон на събитието.Мария Бадева и Ангел Митков - Младежки делегати на България към Организацията на обединените нации.11:35 - 11:45 Преоткриване на градове със студенти: Вашингтон, окръг Колумбия Синтия Юе - Младежки наблюдател на САЩ към Организацията на обединените нации 11:45:12:00 „Устойчиви градове“Domokos Péter Kov ács - младежки делегат на Унгария в Организацията на обединените нацииLilla Judit Bartuszek JD - устойчиви градове,мениджър проекти 12:00 - 12:15 Младежката ангажираност в Литва в градската устойчивост. Клаудиджус Мелис - младежки делегат на Литва към Организацията на обединените нации 12:15 - 12:35 Споделяне на истории за младежката ангажираност в контекста на България Мила Йолова,докторант - Включване на тийнейджъри в процес на приобщаване на планиране. Петър Бодуров & Моника Стефанова - Младежко участие чрез placemaking.12:35 - 12:45 Дискусия,въпроси и отговори и заключителни забележки",
                MeetLink = "https://bit.ly/3rrmEFw",
                ImageName = "9b21036d-5853-47a3-b09b-0a097ee942fa-00150c7c-2270-4191-aee2-ee56a67aa72c.png",
                MaxPeople = 100,
                AddedByUserId = "ec6406bf-06bd-414a-8dd2-c3418336f631",
                CategoryId = 3,
                DateTime = dateTime1,
                CreatedOn = DateTime.UtcNow,
            });

            await dbContext.WebEminars.AddAsync(new WebEminar()
            {
                Title = "Градове на бъдещето",
                Description = "Целта на събитието е създаването на дискусия, като ще бъде обсъден личен опит, научни статии, изследвания, книги и уеб страници относно 'Градовете на бъдещето'.🚀 Ще представим градовете на бъдещето, ще запознаем аудиторията с разработени технологични решения в сферата на образованието, технологията и роботизацията, ще разгледаме най-бързоразвиващите се насоки в модерното бъдеще – екологията и медицината. 🚀 Ще бъде дискутиран ранният старт в навлизането в технологиите. 🚀 Ще разгледаме употребата на световодни влакна, пневматика, водород и пара. Ще бъде дискутирана необходимостта от иновации в екологията. От страна на медицината ще се запознаете с роботизираната хирургия, употребата на ултразвук, магнит, лазер, светлина и други. 🚀 Събитието е подходящо както за деца, така и за хора от всяка възрастова група с интерес към иновациите и развитието на градовете на бъдещето, по-специално темите екология и медицина. 🚀 Специалното за събитието е, че е представено на достъпен език, от лектор, който активно разработва проекти, свързани с градовете на бъдещето и ще се развива в тази насока. Нашият лектор е Александра Умленска, която е ученик в 11. клас в профил „Математически“. Носител е на престижни награди в сферата на технологиите, математиката и природните науки. Лектор е на различни събития, има богат опит в преподаването и презентирането. Разработва проекти в сферата на екологията, образованието и роботизацията. ❗️Събитието ще се проведе в Zoom, затова и МЕСТАТА СА ОГРАНИЧЕНИ! На посочения от вас имейл ще получите инструкции и линк за присъединяване към събитието един ден преди това.",
                MeetLink = "https://forms.gle/m3ukfByCiESHwnbC9",
                ImageName = "241995775_2954414154806444_2346569405980465172_n.jpg",
                MaxPeople = 30,
                AddedByUserId = "ec6406bf-06bd-414a-8dd2-c3418336f631",
                CategoryId = 3,
                DateTime = dateTime2,
                CreatedOn = DateTime.UtcNow,
            });

            await dbContext.WebEminars.AddAsync(new WebEminar()
            {
                Title = "как да правим света около нас 'по-умен'",
                Description = "Ако искате да разберете как да правим света около нас „по-умен“ се присъединете към уебинара „Интернет на Нещата (IoТ)“.🚀 По време на обучението Денис Исметов, създател на Робо Академия и носител на множество отличия в сферата на роботиката, ще ни представи същността на технологията 'Internet of Things', различни елементи от нея, както и практически примери за приложението ѝ. 🚀 Участниците ще могат да се запознаят с различни ресурси, откъдето да се образоват и да черпят вдъхновение. 🚀 Ще бъдат представени конкретни продукти (микроконтролери, сензори, умни джаджи и приложения), които могат да използват в ежедневието си за превръщане на различни предмети в 'Умни', както и цялостна архитектура за 'Умен дом'. ❗️Събитието ще се проведе в Zoom, затова и МЕСТАТА СА ОГРАНИЧЕНИ! На посочения от вас имейл ще получите инструкции и линк за присъединяване към събитието един ден преди това",
                MeetLink = "https://forms.gle/e1nf8z4XyFFe7F9G7",
                ImageName = "241630517_2949452821969244_8033657518907561410_n.jpg",
                MaxPeople = 20,
                AddedByUserId = "ec6406bf-06bd-414a-8dd2-c3418336f631",
                CategoryId = 2,
                DateTime = dateTime3,
                CreatedOn = DateTime.UtcNow,
            });

            await dbContext.WebEminars.AddAsync(new WebEminar()
            {
                Title = "Интернет на нещата",
                Description = "🚀 По време на обучението Денис Исметов, създател на Робо Академия и носител на множество отличия в сферата на роботиката, ни представи същността на технологията 'Internet of Things', различни елементи от нея, както и практически примери за приложението ѝ. 🚀 Участниците се запознаха с различни ресурси, откъдето да се образоват и да черпят вдъхновение. 🚀 Бяха представени конкретни продукти (микроконтролери, сензори, умни джаджи и приложения), които могат да използват в ежедневието си за превръщане на различни предмети в 'Умни', както и цялостна архитектура за 'Умен дом'.",
                Video = "https://youtu.be/BD_4FA0GXPs",
                AddedByUserId = "ec6406bf-06bd-414a-8dd2-c3418336f631",
                CategoryId = 1,
                CreatedOn = DateTime.UtcNow,
            });

            await dbContext.WebEminars.AddAsync(new WebEminar()
            {
                Title = "Що е това Arduino и как да го използваме",
                Description = "❓Що е това Arduino и как да го използваме? На тези въпроси ще ни отговори Денис Исметов – създател на Робо Академия и носител на множество отличия в сферата на роботиката. 🚀 Обучението има за цел да запознае всеки желаещ да се занимава със създаването на хардуерни проекти. По-време на курса участниците ще се научат да създават електронни схеми, след което да ги управляват с помощта на микроконтролер.",
                Video = "https://youtu.be/weYU573uUZ8",
                AddedByUserId = "ec6406bf-06bd-414a-8dd2-c3418336f631",
                CategoryId = 2,
                CreatedOn = DateTime.UtcNow,
            });

            await dbContext.WebEminars.AddAsync(new WebEminar()
            {
                Title = "Разработка на уеб сайтове за начинаещи",
                Description = "Видео запис от онлайн семинара ни към 2-месечния курс по Web програмиране, предназначен за начинаещи. Ще видите интерактивна демонстрация на писане на код на HTML, CSS и JavaScript, които ще изучаваме по време на обучението по Web програмиране. Ще получите и пълна информация за обученията ни за начинаещи. За повече информация: https://softacademy.bg/ Събитието бе проведено чрез онлайн платформата Zoom, чрез която се провеждат всички онлайн обучения в Soft Academy.",
                Video = "https://youtu.be/gmHPWVoM6sA",
                AddedByUserId = "ec6406bf-06bd-414a-8dd2-c3418336f631",
                CategoryId = 1,
                CreatedOn = DateTime.UtcNow,
            });

            await dbContext.SaveChangesAsync();

        }
    }
}
